Smartrek/spidermesh_gateway_esp32/src/spidermeshapi.cpp
    for(int i=0; i<5; i++)
    {
        ret.push_back(cmd[i]);
    } 
    return ret;
}

apiframe SpidermeshApi::setDyn(uint8_t po, uint8_t pi,uint8_t hop, uint8_t rdx, uint8_t rde, uint8_t duty)
{
    //PORTIA_SYNCHRONIZE();
    uint8_t cmd[10] = {0xFB, 7, 0, 0x0A, po, pi, hop, rdx, rde, duty};

    apiframe ret;
    for(int i=0; i<10; i++)
    {
        ret.push_back(cmd[i]);
    } 
    return ret;   
}

apiframe SpidermeshApi::requestMacAddress()
{
    //PORTIA_SYNCHRONIZE();    
    Serial.println("==Request Gateway Mac Address");
    uint8_t cmd[20] = {0xFB, 4, 0, 3, 2,0,8};

    apiframe ret;
    for(int i=0; i<7; i++)
    {
        ret.push_back(cmd[i]);
    } 
    return ret;   
}

//-----------------------------------------------------------------------------------------------
void SpidermeshApi::task()
{
    //manage serial port reception
    if(!parseReceivedData()) delay(10);

    //If the fifo is holding message
    if(!isMessageStackEmpty())
    {
        
        apiframe cmd = checkNextPacketToSend();
        if(cmd.size() >3 )
        {
            //Serial.println("messge stack sent");
            if(cmd[3] != PACKET_TXAIR_CMD_WRAPPER) _otaPacketInCycle = sendNextPacketBuffered();
            //delay(50);
        }
    }

}

//------------------------------------------------------------------------------------------------
void SpidermeshApi::initWatchdogParser()
{
    watchdog_serial_parser = true;
    previousMillisPacketParser = millis();
    //LedRemoteOn();
}

//------------------------------------------------------------------------------------------------
void SpidermeshApi::disableWatchdogParser()
{
    watchdog_serial_parser = false;
    //LedRemoteOff();
}


//------------------------------------------------------------------------------------------------
bool SpidermeshApi::parseReceivedData()
{
    bool ret = false;
    if (smkport.available())
    {
        ret = true;
        unsigned char rx = smkport.read();
        //Serial.write(state_serial); //debug line
        //Serial.write(rx);

      #if SHOW_RECEIVED_BYTE_FROM_SMK900
        char result2[10];
        sprintf(result2, "%02X ", rx);
        Serial.print(result2);
      #endif

        switch (state_serial)
        {
            case STATE_SOF:
                if (rx == 0xFB)
                {
                    state_serial = STATE_LENGTH;
                    idx_buf = 0;
                    length_packet = 0;
                    current_packet.clear();
                    current_packet.push_back(rx);
                    idx_buf++;
                    initWatchdogParser();
                }
                break;
            case STATE_LENGTH:
                if (length_packet == 0){
                    current_packet.push_back(rx);
                    idx_buf++;
                    length_packet += rx;
                }
                else
                {
                    current_packet.push_back(rx);
                    idx_buf++;
                    length_packet += rx*256;
                    state_serial = STATE_DATA; 
                }
                break;
            case STATE_DATA:
                //read serial port char
                current_packet.push_back(rx);
                idx_buf++;

                //Lenght of packet reach, packet ready to parse
                if (idx_buf >= length_packet+3)
                {
                    disableWatchdogParser();
                    state_serial = STATE_PACKET;
                    #if SHOW_RECEIVED_BYTE_FROM_SMK900
                        Serial.println();
                    #endif

                    CheckIfAnswerWasExpectedAndCallSuccessFunction(current_packet);
                    cbWhenPacketReceived(current_packet);
                    //IS EOB
                    if(isEobPacket(current_packet))
                    {
                        eob_cnt++; //counter manage at higher level
                      #if PRINT_EOB_AS_DOT
                        Serial.print(".");
                      #endif                        

                        _otaPacketInCycle = false;

                        CheckExpectTimeout();
                        WhenEobIsReceived(true);

                        if(show_eob)printApiPacket(current_packet, PREFIX_IN);
                    
                        delay(100);
                    }
                    else if(show_apipkt_in)printApiPacket(current_packet, PREFIX_IN);

                  #if TERMINAL_ENABLED
                    AddToTerminalBuffer("in :", &current_packet);
                  #endif                    

                    state_serial = STATE_SOF;
                }
                break;

            default:
                state_serial = STATE_SOF;
                break;
        }
    }


    //if a message is currently beeing readed, watchdog will be activated at first character received
    //after a time without a complete packet, buffer will be flushed to get the next one.
    //this is a simple way to parse message and if parsing machine is lost.
    if (watchdog_serial_parser)
    {
        unsigned long currentMillis = millis();
        if (currentMillis - previousMillisPacketParser >= timeout_parser)
        {
            // save the last time you blinked the LED
            previousMillisPacketParser = currentMillis;
            idx_buf = 0;
            length_packet = 0;
            disableWatchdogParser();
            //LedRemoteOn();
        }
    }
    return ret;
}


//------------------------------------------------------------------------------------------------
void SpidermeshApi::parseApiFromHost(uint8_t* buf, uint16_t len)
{
    uint16_t id_pkt = 0;
    uint8_t state_pkt = STATE_SOF;
    static uint16_t len_pkt;
    uint16_t last_idx_packet = 0;
    commandList_t cmd_list_ok;
    apiframe cmd_pkt;


    while(id_pkt < len)
    {
        switch (state_pkt)
        {
            case STATE_SOF:
                if (buf[id_pkt] == 0xFB)
                {
                    state_pkt = STATE_LENGTH;
                    len_pkt = 0;
                    cmd_pkt.push_back(buf[id_pkt]);
                }
                id_pkt++;
                break;
            case STATE_LENGTH:
                if (len_pkt == 0){
                    cmd_pkt.push_back(buf[id_pkt]);
                    len_pkt += buf[id_pkt];
                }
                else
                { 
                    cmd_pkt.push_back(buf[id_pkt]);
                    len_pkt += ((uint16_t)buf[id_pkt])*256;
                    state_pkt = STATE_DATA; 
                }
                id_pkt++;
                break;
            case STATE_DATA:
                //read serial port char
                cmd_pkt.push_back(buf[id_pkt]);
                id_pkt++;
                
                //Lenght of packet reach, packet ready to parse
                if (id_pkt-last_idx_packet >= len_pkt+3)
                {
                    last_idx_packet= id_pkt;
                    addApiPacketLowPriority(cmd_pkt);

                    //Serial.println("  will be sent");
                    cmd_pkt.clear();
                    state_pkt = STATE_SOF;
                }
                break;

            default:
                state_pkt = STATE_SOF;
                break;
        }
    }

