Smartrek/spidermesh_gateway_esp32/src/spidermeshapi.cpp
}





//-------------------------------
String SpidermeshApi::sendCommand(apiframe cmd)
{
    for (int i = 0; i < cmd.size(); i++){
        write(cmd[i]);
    }


    String cmd_out = hexPacketToAscii(cmd);
    #if SHOW_TRANSMITED_PACKET_TO_SMK900
    printApiPacket(cmd, "out: ");    
    //Serial.println(cmd_out);
    #endif
    #if TERMINAL_ENABLED
    AddToTerminalBuffer("out:", &cmd);
    #endif

    return cmd_out;
}

void SpidermeshApi::AddToTerminalBuffer(String head, apiframe *cmd)
{
    terminalBuffer.push_back(head +  hexPacketToAscii(*cmd));

    if (terminalBuffer.size() > NB_PACKET_TERMINAL)
        terminalBuffer.pop_front();    


}

//------------------------------------------------------------------------------------------------
// This function will poll the next on demand command
// It is taking the place of the normal base polling list
// It should be send after receiving an end of broadcast marker
//
bool SpidermeshApi::sendNextPacketBuffered()
{
    bool ret = false;

    if (writeAndExpectList.size()>0 || lowPriorityFifoCommandList.size() > 0 || highPriorityFifoCommandList.size() > 0)
    {
        //send the command
    #if SHOW_TRANSMITED_PACKET_TO_SMK900 && 0
        Serial.print("on demand cmd sent: ");
    #endif
        apiframe cmd;
        if(highPriorityFifoCommandList.size() > 0)
        {
            cmd = highPriorityFifoCommandList.front();
            highPriorityFifoCommandList.pop_front();
            sendCommand(cmd);
        }
        else if(lowPriorityFifoCommandList.size() > 0)
        {
            cmd = lowPriorityFifoCommandList.front();
            lowPriorityFifoCommandList.pop_front();
            sendCommand(cmd);
        }
        else if(writeAndExpectList.size()>0)
        {
            //Serial.printf("writeAndExpectList.size():%d\r\n",writeAndExpectList.size());
            MeshRequest_t req = writeAndExpectList.front();
            writeAndExpectList.pop_front();
            WriteAndExpectAnwser(req.pNode, req.payload, PACKET_VM_RESP, req.tag, req.callback);
        }
        else 
        
        ret = true;
    }


    return ret;
}

unsigned int SpidermeshApi::toInt(byte c)
{
    if (c >= '0' && c <= '9')
        return c - '0';
    if (c >= 'A' && c <= 'F')
        return 10 + c - 'A';
    if (c >= 'a' && c <= 'f')
        return 10 + c - 'a';
    return -1;
}




bool SpidermeshApi::addApiPacketLowPriority(String asciiCommand)
{

    apiframe od_pkt = convertAsciiTohexCommand(asciiCommand.c_str());
    //printApiPacket(od_pkt);
    addApiPacketLowPriority(od_pkt);
    return true;
}

bool SpidermeshApi::addApiPacketLowPriority(uint8_t* buffer, int size)
{
    apiframe buf_hex;
    for(int i=0; i<size;i++)
    {
        buf_hex.push_back(buffer[i]);
    }
    addApiPacketLowPriority(buf_hex);
    return true;
}
/*
bool SpidermeshApi::addApiPacketLowPriority(apiframe hcmd)
{
    lowPriorityFifoCommandList.push_back(hcmd);
    return true;
}
*/

bool SpidermeshApi::addApiPacketLowPriority(apiframe hcmd)
{
    if(lowPriorityFifoCommandList.size() <= PORTIA_FIFO_LOW_PRIORITY_SIZE)
    {
#if ON_DEMAND_COMMAND_MUST_BE_DIFFERENT_FROM_THE_LAST_ONE == 1
        if(hcmd != lowPriorityFifoCommandList.back())
        {
            lowPriorityFifoCommandList.push_back(hcmd);
            return true;
        }
        else
        {
            Serial.println("Exact same command is present in the list so we discard the newest one");
        }
#else
        lowPriorityFifoCommandList.push_back(hcmd);
#endif
    }
    else
    {
        Serial.println("maximum FIFO size reached!");
    }
    

    return false;
}


bool SpidermeshApi::addApiPacketHighPriority(apiframe hcmd)
{
    if(highPriorityFifoCommandList.size() <= PORTIA_FIFO_HIGH_PRIORITY_SIZE)
    {
    #if ON_DEMAND_COMMAND_MUST_BE_DIFFERENT_FROM_THE_LAST_ONE == 1
        if(hcmd != highPriorityFifoCommandList.back())
        {
            highPriorityFifoCommandList.push_back(hcmd);
        }
    #else
        highPriorityFifoCommandList.push_back(hcmd);
    #endif
        return true;
    }
    return false;
}



void SpidermeshApi::WriteAndExpectAnwser(mesh_t::iterator pNode, apiframe request, uint8_t packet_type, String tag, ExpectCallback cb)
{
    uint max_retry = DEFAULT_MAX_TRY_TO_SEND;
    apiframe expectPayload;
    int16_t size = -1;

    WriteAndExpectAnwser(pNode,request,packet_type,max_retry,expectPayload, size, tag, cb);
}
void SpidermeshApi::WriteAndExpectAnwser(mesh_t::iterator pNode, apiframe request, uint8_t packet_type, uint8_t max_retry, String tag,ExpectCallback cb)
{
    apiframe expectPayload;
    int16_t size = -1;

    WriteAndExpectAnwser(pNode,request,packet_type,max_retry,expectPayload, size, tag, cb);
}

void SpidermeshApi::WriteAndExpectAnwser(  mesh_t::iterator pNode, 
                                    apiframe request, 
                                    uint8_t packet_type,                                      
                                    uint8_t max_retry, 
                                    apiframe expectPayload, 
                                    int16_t size, 
                                    String tag,
                                    ExpectCallback cb)
{
  #if SHOW_EXPECT_EVENT
    Serial.println("SHOW_EXPECT_EVENT");
  #endif
    
    //check if not already exist
    bool found = false;
    for (auto i:listOfExpectedAnswer)
    {
        if ( i._pNode == pNode && i._request == request) found = true;
    }

    #define MAX_EXPECT_LIST 10
    if(!found)
    {
        if(listOfExpectedAnswer.size() < MAX_EXPECT_LIST)
        {


            ExpectAnswer toWaitAnswerElem(pNode, packet_type, request, cb, tag, max_retry, expectPayload, size);
            listOfExpectedAnswer.push_back(toWaitAnswerElem);
            sendCommand(request);
        }
        else PRTLN("MAX_EXPECT_LIST reached");
    }
    #if SHOW_EXPECT_EVENT
    #endif
    else  PRTLN("Already in Expected list");
}
//void SpidermeshApi::





void SpidermeshApi::CheckIfAnswerWasExpectedAndCallSuccessFunction(apiframe rxPkt)
{
  #if SHOW_EXPECT_EVENT
    //Serial.println("CheckIfAnswerWasExpectedAndCallSuccessFunction()");
  #endif    
    //check if there is something to expect
    if(listOfExpectedAnswer.size() > 0)
    {
        std::list<ExpectAnswer>::iterator i = listOfExpectedAnswer.begin();

