Smartrek/spidermesh_gateway_esp32/src/spidermeshapi.cpp
            //expiration of the focus mode, will return to the programmed polling_mode variable
            else
            {
                focus_node=0;   
                Serial.println("exit focus mode");
            }


        }
        else if(polling_mode == "time")
        {
          #if SHOW_AUTOMATIC_POLLING
            Serial.println("time based polling mode");
          #endif          
            
            if(seconds - pCurrentNode->second.elapse_time >= pCurrentNode->second.sample_rate && isnt_already_in_expect_list)
            {
                //must_increase_polling_iterator = true;
                findNext();


                pPoll = pCurrentNode;
            }
        }
        else if(polling_mode == "fast")
        {
          #if SHOW_AUTOMATIC_POLLING
            Serial.println("fast based polling mode");
          #endif          
            //must_increase_polling_iterator = true;
            findNext();
            pPoll = pCurrentNode;
        }


        //if the 
        if(pPoll != nodes.pool.end())
        {
            #if SHOW_AUTOMATIC_POLLING
                Serial.println("SHOW_AUTOMATIC_POLLING");
                delay(100);
                Serial.println(pPoll->second.getMacAsString());
                //Serial.printf ("Automatic Polling --> millis   %lu  -  %lu >= %d\n", seconds, pPoll->second.elapse_time, pCurrentNode->second.sample_rate);
            #elif SHOW_MIN_DEBUG
                Serial.print("?");
            #endif
            pPoll->second.elapse_time = seconds;
            String t = pPoll->second.type; 
            apiframe rqt_status;

            //we build the request frame 
            
            
            apiframe user_req_to_append = cbAutoRequestBuilder(pPoll);

            if(user_req_to_append.size() >0) rqt_status = user_req_to_append;
            else if(nodes.getTypeJsonVariant()[t]["command"].containsKey("status"))
                rqt_status.push_back(nodes.getTypeJsonVariant()[t]["command"]["status"]["rqst"].as<byte>());

            //set the address of the node to poll in the transmission buffer
            byte sz = 6 + rqt_status.size();
            smkPacket = {0xFB, sz, 0, 0x0C, 0x00, PACKET_VM_REQUEST};

            smkPacket.push_back(pPoll->second.mac.bOff[byte0]);
            smkPacket.push_back(pPoll->second.mac.bOff[byte1]);
            smkPacket.push_back(pPoll->second.mac.bOff[byte2]);

            //add custom payload from json file if available
            for(auto c : rqt_status) smkPacket.push_back(c);        
            
            #if SHOW_TRANSMITED_PACKET_TO_SMK900 || SHOW_AUTOMATIC_POLLING
            printApiPacket(smkPacket, "out: ");
            #endif
            
            //write the polling command 

            WriteAndExpectAnwser(pPoll, smkPacket, 0x0E, "status", cbAutomaticPolling);
        }
        /*
        if(must_increase_polling_iterator)
        {
            pCurrentNode++;
            if(pCurrentNode == nodes.pool.end()) pCurrentNode = nodes.pool.begin();
        }
        */

    }
    //else Serial.println();
}


bool SpidermeshApi::enableAutomaticPolling(String mode,String mac, uint16_t duration){
    bool ret = true;


    if(mode == "focus")
    {
        _duration_focus_on_node_polling = duration;
        focus_node_start_time=millis();
        if(!setFocusMode(mac))
        {   
            focus_node = 0;
            ret = false;
        }
        if(focus_node)
        {
            Serial.print("enter focus mode for ");
            Serial.print(duration);
            Serial.print("   _dur= ");
            Serial.println(_duration_focus_on_node_polling);
        }
    }
    else if (mode != "time" || mode != "fast")
    {
        
        polling_mode = mode; //default mode
        setAutoPollingNodeMode(true);
    }
    else if (mode == "disabled" || readFile("pollingMode") == "disabled")
    {
        setAutoPollingNodeMode(false);
    }
    return ret;
}

#define DEBUG_FINDNEXT false
bool SpidermeshApi::findNext(bool onlyRemote, bool initSearch)
{
	bool ret = false;
	mesh_t::iterator next = pCurrentNode;

    #if DEBUG_FINDNEXT
    if(nodes.pool.size() <= 1)
    {
        Serial.println("no node, so can't find next");
    }
    Serial.println("find next start");
    #endif

	if (initSearch)
	{
        #if DEBUG_FINDNEXT
        Serial.println("Init search");
        #endif
		next = nodes.pool.begin();
	}
	else next++;

	int nbCheck = 0;
	while (nbCheck < nodes.pool.size())
	{
		if (next == nodes.pool.end()) next = nodes.pool.begin();

        if(onlyRemote && next->second.local){
            #if DEBUG_FINDNEXT
            Serial.println("Local so search next");
            Serial.println(next->second.getMacAsString());
            #endif
            next++;
        } 
        else {
            pCurrentNode = next;
            #if DEBUG_FINDNEXT

            Serial.print("mac found is: ");
            Serial.println(next->second.getMacAsString());
            #endif
            ret = true; 
            break;
        };
        nbCheck++;
	}

    #if DEBUG_FINDNEXT
    if(!ret)
    {
        Serial.println("No node found");
    }
    Serial.println("find next end");
    #endif

	return ret;
}
